//《数据结构（Java版）（第4版）》，作者：叶核亚，2014年8月16日
//第9章   排序9.1~9.4 排序
//9.1.1   直接插入排序
//【例9.1】 随机数序列的直接插入排序。

public class Sort_例9_1 
{
    public static void main(String[] args) 
    {
//        int[] keys = Array1.randomInt(10,100);          //例9.1
//      int[] keys = {32,26,87,72,26,17};             //图9.1 直接插入排序；图9.3 冒泡排序
//      int[] keys = {38,55,65,97,27,76,27,13,19};    //图9.2 希尔排序
//      int[] keys = {1,2,3,4,5,6,7,8};                   //冒泡排序，快速排序，最小堆
//      int[] keys = {1,3,2,4,5,8,6,7};                   //冒泡排序
//      int[] keys = {4,5,8,1,2,7,3,6};                   //冒泡排序
//      int[] keys = {8,7,6,5,4,3,2,1};                   //冒泡排序，快速排序
//        int[] keys = {38,38,97,75,61,19,26,49};           //图9.6~7 快速排序
//        int[] keys = {38,97,26,19,38,15};                  //图9.8 直接选择排序
//        int[] keys = {81,49,19,38,97,76,13,27};           //图9.9 最小/大堆
        int[] keys = {81,49,19,38,97,76,13,19};           //图9.10 堆排序
//    int[] keys = {97,82,75,53,17,61,70,12,61,58,26};     //图9.12 归并排序

        System.out.print("关键字序列：");  Array1.print(keys);  //见例1.4
//        Array9.insertSort(keys);
//        Array9.shellSort(keys);
//        Array9.bubbleSort(keys);                        //升序
//        Array9.bubbleSort(keys,false);                  //降序
//        Array9.quickSort(keys);
//        Array9.selectSort(keys);
//        Array9.heapSort(keys,true);                    //最小堆，降序
//        Array9.heapSort(keys,false);                   //最大堆，升序
        Array9.heapSort(keys,true);                    //（第5版）升序，最大堆
//        Array9.heapSort(keys,false);                    //（第5版）降序，最小堆
//        Array9.mergeSort(keys);
    }
}
/* 
程序运行结果如下：
关键字序列:  32 26 87 72 26 17                        //图9.1 直接插入排序（升序）
第1趟:  26 32 87 72 26 17
第2趟:  26 32 87 72 26 17
第3趟:  26 32 72 87 26 17
第4趟:  26 26 32 72 87 17                           //排序算法稳定
第5趟:  17 26 26 32 72 87

关键字序列： 32 26 87 72 26 17，直接插入排序（降序）
第1趟 temp=26  32 26 87 72 26 17
第2趟 temp=87  87 32 26 72 26 17
第3趟 temp=72  87 72 32 26 26 17
第4趟 temp=26  87 72 32 26 26 17
第5趟 temp=17  87 72 32 26 26 17

关键字序列： 38 55 65 97 27 76 27 13 19                //图9.2 希尔排序
delta=4   19 55 27 13 27 76 65 97 38
delta=2   19 13 27 55 27 76 38 97 65
delta=1   13 19 27 27 38 55 65 76 97

关键字序列： 38 55 65 97 27 76 27 13 19，希尔排序（降序）
delta=4   38 76 65 97 27 55 27 13 19
delta=2   65 97 38 76 27 55 27 13 19
delta=1   97 76 65 55 38 27 27 19 13

关键字序列：  32  26  87  72  26  17，冒泡排序（升序）                //图9.3 冒泡排序
第1趟，下标0～5，  26  32  72  26  17  87
第2趟，下标0～4，  26  32  26  17  72  87
第3趟，下标0～3，  26  26  17  32  72  87
第4趟，下标0～2，  26  17  26  32  72  87
第5趟，下标0～1，  17  26  26  32  72  87

关键字序列：  32  26  87  72  26  17，冒泡排序（降序）              //【思考题9-1】① ，课件答
第1趟，下标0～5，  32  87  72  26  26  17
第2趟，下标0～4，  87  72  32  26  26  17
第3趟，下标0～3，  87  72  32  26  26  17


关键字序列:  1 2 3 4 5 6 7 8，冒泡排序
第1趟排序:  1 2 3 4 5 6 7 8

关键字序列:  1 3 2 4 5 8 6 7，冒泡排序
第1趟排序:  1 2 3 4 5 6 7 8
第2趟排序:  1 2 3 4 5 6 7 8

关键字序列:  4 5 8 1 2 7 3 6，冒泡排序
第1趟排序:  4 5 1 2 7 3 6 8
第2趟排序:  4 1 2 5 3 6 7 8
第3趟排序:  1 2 4 3 5 6 7 8
第4趟排序:  1 2 3 4 5 6 7 8
第5趟排序:  1 2 3 4 5 6 7 8

关键字序列:  8 7 6 5 4 3 2 1，冒泡排序
第1趟:  7 6 5 4 3 2 1 8
第2趟:  6 5 4 3 2 1 7 8
第3趟:  5 4 3 2 1 6 7 8
第4趟:  4 3 2 1 5 6 7 8
第5趟:  3 2 1 4 5 6 7 8
第6趟:  2 1 3 4 5 6 7 8
第7趟:  1 2 3 4 5 6 7 8

关键字序列：  38  38  97  75  61  19  26  49，快速排序（升序）                        //图9.6～7 快速排序
下标0～7， vot=38，    26  38  19  38  61  75  97  49
下标0～2， vot=26，    19  26  38  38  61  75  97  49
下标4～7， vot=61，    19  26  38  38  49  61  97  75
下标6～7， vot=97，    19  26  38  38  49  61  75  97

关键字序列:  1 2 3 4 5 6 7 8，快速排序  
0..7,  vot=1   1 2 3 4 5 6 7 8
1..7,  vot=2   1 2 3 4 5 6 7 8
2..7,  vot=3   1 2 3 4 5 6 7 8
3..7,  vot=4   1 2 3 4 5 6 7 8
4..7,  vot=5   1 2 3 4 5 6 7 8
5..7,  vot=6   1 2 3 4 5 6 7 8
6..7,  vot=7   1 2 3 4 5 6 7 8

关键字序列:  8 7 6 5 4 3 2 1，快速排序  
0..7,  vot=8   1 7 6 5 4 3 2 8
0..6,  vot=1   1 7 6 5 4 3 2 8
1..6,  vot=7   1 2 6 5 4 3 7 8
1..5,  vot=2   1 2 6 5 4 3 7 8
2..5,  vot=6   1 2 3 5 4 6 7 8
2..4,  vot=3   1 2 3 5 4 6 7 8
3..4,  vot=5   1 2 3 4 5 6 7 8


关键字序列：  38  97  26  19  38  15，直接选择排序（升序）                 //图9.8 直接选择排序
第1趟，下标0～5，min=5，  15  97  26  19  38  38
第2趟，下标1～5，min=3，  15  19  26  97  38  38
第3趟，下标2～5，min=2，  15  19  26  97  38  38
第4趟，下标3～5，min=4，  15  19  26  38  97  38
第5趟，下标4～5，min=5，  15  19  26  38  38  97

关键字序列： 38 97 26 19 38 15，直接选择排序（降序）
第1趟   97 38 26 19 38 15
第2趟   97 38 26 19 38 15
第3趟   97 38 38 19 26 15
第4趟   97 38 38 26 19 15
第5趟   97 38 38 26 19 15

关键字序列： 81 49 19 38 97 76 13 19                  //（第4版）图9.10 堆排序，最小堆
建立最小堆序列
sift  3..7   81 49 19 19 97 76 13 38
sift  2..7   81 49 13 19 97 76 19 38
sift  1..7   81 19 13 38 97 76 19 49
sift  0..7   13 19 19 38 97 76 81 49              //图9.9（a）最小堆
最小堆？ true，最大堆？ false
堆排序（降序）
sift  0..6   19 38 19 49 97 76 81 13              //图9.10 堆排序
sift  0..5   19 38 76 49 97 81 19 13
sift  0..4   38 49 76 81 97 19 19 13
sift  0..3   49 81 76 97 38 19 19 13
sift  0..2   76 81 97 49 38 19 19 13
sift  0..1   81 97 76 49 38 19 19 13
sift  0..0   97 81 76 49 38 19 19 13

关键字序列： 81 49 19 38 97 76 13 19
建立最大堆序列
sift  3..7   81 49 19 38 97 76 13 19
sift  2..7   81 49 76 38 97 19 13 19
sift  1..7   81 97 76 38 49 19 13 19
sift  0..7   97 81 76 38 49 19 13 19             //最大堆，最后一个元素与图9.9（b）不同
最小堆？ false，最大堆？ true
堆排序（升序）
sift  0..6   81 49 76 38 19 19 13 97
sift  0..5   76 49 19 38 19 13 81 97
sift  0..4   49 38 19 13 19 76 81 97
sift  0..3   38 19 19 13 49 76 81 97
sift  0..2   19 13 19 38 49 76 81 97
sift  0..1   19 13 19 38 49 76 81 97
sift  0..0   13 19 19 38 49 76 81 97

关键字序列：  81  49  19  38  97  76  13  19               //（第5版程序），图9.10~11，降序
最小堆：  13  19  19  38  97  76  81  49
非递归算法，最小堆？ true，最大堆？ false
堆排序（降序）：  97  81  76  49  38  19  19  13

关键字序列：  81  49  19  38  97  76  13  19               //（第5版程序），图9.10序列，升序
最大堆：  97  81  76  38  49  19  13  19
非递归算法，最小堆？ false，最大堆？ true
堆排序（升序）：  13  19  19  38  49  76  81  97


关键字序列： 97 82 75 53 17 61 70 12 61 58 26，归并排序（升序）     //图9.12 归并排序
子序列长度n=1   82 97 53 75 17 61 12 70 58 61 26
子序列长度n=2   53 75 82 97 12 17 61 70 26 58 61
子序列长度n=4   12 17 53 61 70 75 82 97 26 58 61
子序列长度n=8   12 17 26 53 58 61 61 70 75 82 97

关键字序列： 97 82 75 53 17 61 70 12 61 58 26，归并排序（降序）
子序列长度n=1   97 82 75 53 61 17 70 12 61 58 26
子序列长度n=2   97 82 75 53 70 61 17 12 61 58 26
子序列长度n=4   97 82 75 70 61 53 17 12 61 58 26
子序列长度n=8   97 82 75 70 61 61 58 53 26 17 12

*/
//@author：Yeheya。2014-8-18

